workspace/InformationRegisters/АукИсторияДанныхАукционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукИсторияДанныхАукционов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеЭлементаДанных</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.АукЭлементыДанныхАукционов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НаправлениеДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АукНаправленияДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АукВидыДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукКонтактныеЛицаУчастниковАукционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭлементДанных</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/InformationRegisters/АукИсторияСтатусовАукционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукИсторияСтатусовАукционов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АукСтатусыАукционов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/InformationRegisters/АукИтогиЗавершенияЭтапов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукИтогиЗавершенияЭтапов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатРасчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеРезультатаРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаСтавки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/Enums/АукВидыДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>АукВидыДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

workspace/Enums/АукСтатусыАукционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>АукСтатусыАукционов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодведениеПромежуточныхИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НовыйЭтап</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодведениеИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

workspace/Enums/АукНаправленияДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>АукНаправленияДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

workspace/Catalogs/АукАукционы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>АукАукционы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидАукциона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукВидыАукционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийАукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийСтарт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПереходКПодведениюПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеПодведениеПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПереходКПодведениюОкончательныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеПодведениеОкончательныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукКонтактныеЛицаУчастниковАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаНачальныхДанных</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементНачальныхДанных</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНачальныхДанных</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АукЭлементыДанныхАукционов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьДни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьЧасы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АукЭлементыДанныхАукционов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

workspace/InformationRegisters/АукИсторияДанныхАукционов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ДобавитьЗапись(пСтруктураЗаписи) Экспорт
	
	сткРез = АукОбщийСервер.ДобавитьЗаписьВРегистрСведений(пСтруктураЗаписи, "АукИсторияДанныхАукционов");
	
	Если Не сткРез.Успех Тогда
		ВызватьИсключение сткРез.Ошибка;	
	КонецЕсли;	
	
КонецФункции

Функция ДобавитьЗаписи(пМасЗаписи) Экспорт	
	
	сткРез = АукОбщийСервер.ДобавитьЗаписиВРегистрСведений(пМасЗаписи, "АукИсторияДанныхАукционов");
	
	Если Не сткРез.Успех Тогда
		ВызватьИсключение сткРез.Ошибка;	
	КонецЕсли;
	
КонецФункции

Функция УдалитьЗапись(пСтруктураЗаписи) Экспорт
	
	Возврат АукОбщийСервер.УдалитьНаборЗаписейВРегистреСведений(пСтруктураЗаписи, "АукИсторияДанныхАукционов");
	
КонецФункции

Функция ТекущиеДанныеСтавокУчастниковАукционаВСтроке(пАукцион, пВидАукциона = Неопределено, пСтрОбязательныеКолонки = Неопределено) Экспорт
	
	Если пВидАукциона = Неопределено Тогда	
		пВидАукциона = Справочники.АукАукционы.КлючевыеДанныеАукциона(пАукцион).ВидАукциона;	
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АукИсторияДанныхАукционов.Период КАК Период,
	|	АукИсторияДанныхАукционов.Аукцион КАК Аукцион,
	|	АукИсторияДанныхАукционов.Участник КАК Участник,
	|	АукИсторияДанныхАукционов.ВидДанных КАК ВидДанных
	|ПОМЕСТИТЬ втТемп
	|ИЗ
	|	РегистрСведений.АукИсторияДанныхАукционов КАК АукИсторияДанныхАукционов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(АукИсторияДанныхАукционов.Период) КАК Период,
	|			АукИсторияДанныхАукционов.Аукцион КАК Аукцион,
	|			АукИсторияДанныхАукционов.Участник КАК Участник
	|		ИЗ
	|			РегистрСведений.АукИсторияДанныхАукционов КАК АукИсторияДанныхАукционов
	|		ГДЕ
	|			АукИсторияДанныхАукционов.Аукцион = &Аукцион
	|		
	|		СГРУППИРОВАТЬ ПО
	|			АукИсторияДанныхАукционов.Аукцион,
	|			АукИсторияДанныхАукционов.Участник) КАК ВложенныйЗапрос
	|		ПО АукИсторияДанныхАукционов.Период = ВложенныйЗапрос.Период
	|			И АукИсторияДанныхАукционов.Аукцион = ВложенныйЗапрос.Аукцион
	|			И АукИсторияДанныхАукционов.Участник = ВложенныйЗапрос.Участник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АукЭлементыДанныхАукционов КАК АукЭлементыДанныхАукционов
	|		ПО АукИсторияДанныхАукционов.ЭлементДанных = АукЭлементыДанныхАукционов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	АукИсторияДанныхАукционов.Период КАК ДатаСтавки,
	|	АукИсторияДанныхАукционов.Участник КАК Участник,
	|	АукИсторияДанныхАукционов.СтрокаДанных КАК СтрокаДанных,
	//|	АукИсторияДанныхАукционов.ЭлементДанных КАК ЭлементДанных,
	|	АукИсторияДанныхАукционов.ЗначениеЭлементаДанных КАК ЗначениеЭлементаДанных,
	|	АукИсторияДанныхАукционов.КонтактноеЛицо КАК КонтактноеЛицо,
	|	АукЭлементыДанныхАукционов.ТехническоеНаименование КАК ТехническоеНаименование
	|ИЗ
	|	РегистрСведений.АукИсторияДанныхАукционов КАК АукИсторияДанныхАукционов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТемп КАК втТемп
	|		ПО (втТемп.Период = АукИсторияДанныхАукционов.Период)
	|			И (втТемп.Аукцион = АукИсторияДанныхАукционов.Аукцион)
	|			И (втТемп.Участник = АукИсторияДанныхАукционов.Участник)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АукЭлементыДанныхАукционов КАК АукЭлементыДанныхАукционов
	|		ПО АукИсторияДанныхАукционов.ЭлементДанных = АукЭлементыДанныхАукционов.Ссылка
	|ГДЕ
	|	АукИсторияДанныхАукционов.ВидДанных = ЗНАЧЕНИЕ(Перечисление.АукВидыДанных.Ставка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АукИсторияДанныхАукционов.Период,
	|	АукИсторияДанныхАукционов.Участник,
	|	АукИсторияДанныхАукционов.СтрокаДанных,
	//|	АукИсторияДанныхАукционов.ЭлементДанных,
	|	АукИсторияДанныхАукционов.ЗначениеЭлементаДанных,
	|	АукИсторияДанныхАукционов.КонтактноеЛицо,
	|	АукЭлементыДанныхАукционов.ТехническоеНаименование
	|ИЗ
	|	РегистрСведений.АукИсторияДанныхАукционов КАК АукИсторияДанныхАукционов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(АукИсторияДанныхАукционов.Период) КАК Период,
	|			АукИсторияДанныхАукционов.Аукцион КАК Аукцион,
	|			АукИсторияДанныхАукционов.Участник КАК Участник
	|		ИЗ
	|			РегистрСведений.АукИсторияДанныхАукционов КАК АукИсторияДанныхАукционов
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТемп КАК втТемп
	|				ПО АукИсторияДанныхАукционов.Период < втТемп.Период
	|					И АукИсторияДанныхАукционов.Аукцион = втТемп.Аукцион
	|					И АукИсторияДанныхАукционов.Участник = втТемп.Участник
	|					И (втТемп.ВидДанных = ЗНАЧЕНИЕ(Перечисление.АукВидыДанных.Сообщение))
	|		ГДЕ
	|			АукИсторияДанныхАукционов.ВидДанных <> ЗНАЧЕНИЕ(Перечисление.АукВидыДанных.Сообщение)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			АукИсторияДанныхАукционов.Аукцион,
	|			АукИсторияДанныхАукционов.Участник) КАК ВложенныйЗапрос
	|		ПО АукИсторияДанныхАукционов.Период = ВложенныйЗапрос.Период
	|			И АукИсторияДанныхАукционов.Аукцион = ВложенныйЗапрос.Аукцион
	|			И АукИсторияДанныхАукционов.Участник = ВложенныйЗапрос.Участник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АукЭлементыДанныхАукционов КАК АукЭлементыДанныхАукционов
	|		ПО АукИсторияДанныхАукционов.ЭлементДанных = АукЭлементыДанныхАукционов.Ссылка
	|ГДЕ
	|	АукИсторияДанныхАукционов.ВидДанных = ЗНАЧЕНИЕ(Перечисление.АукВидыДанных.Ставка)
	|ИТОГИ ПО
	|	Участник,
	|	СтрокаДанных";	
	
	Запрос.УстановитьПараметр("Аукцион", пАукцион);
	
	ПосленийПакет = АукОбщийСервер.СвойстваПоследнегоПакетаЗапроса(Запрос.Текст);
	
	масСтруктураСтавки = Справочники.АукВидыАукционов.ОписаниеСтруктурыСтавкиПоВидуАукциона(пВидАукциона);
		
	Если пСтрОбязательныеКолонки <> Неопределено Тогда
		масКолонки = ОбщегоНазначенияКлиентСервер.ВыгрузитьКолонку(ПосленийПакет.Колонки, "Псевдоним");
		
		масВычитание = СтрРазделить(пСтрОбязательныеКолонки, ",");
		
		масРез = ОбщегоНазначенияКлиентСервер.РазностьМассивов(масКолонки, масВычитание);  
		
		стрИменаКолонокИсключения = СтрСоединить(масРез, ",");
	Иначе
		стрИменаКолонокИсключения = "ЗначениеЭлементаДанных,ТехническоеНаименование";	
	КонецЕсли;
	
	тзРезультат = АукОбщийСервер.СоздатьТаблицуПоСоставуКолонок(ПосленийПакет.Колонки, стрИменаКолонокИсключения, масСтруктураСтавки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	АукОбщийСервер.ЗаполнитьДанныеУчастниковПоРезультатуЗапроса(тзРезультат, РезультатЗапроса,
				ПосленийПакет.КонтрольныеТочкиИтогов.Количество(), "ТехническоеНаименование", "ЗначениеЭлементаДанных"); 
	
	Возврат тзРезультат;
		
КонецФункции

Функция ПолнаяИсторияСтавокУчастниковАукционаВСтроке(пАукцион, пВидАукциона = Неопределено) Экспорт
	
	Если пВидАукциона = Неопределено Тогда	
		пВидАукциона = Справочники.АукАукционы.КлючевыеДанныеАукциона(пАукцион).ВидАукциона;	
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукИсторияДанныхАукционов.Период КАК Период,
	|	АукИсторияДанныхАукционов.Участник КАК Участник,
	|	АукИсторияДанныхАукционов.СтрокаДанных КАК СтрокаДанных,
	//|	АукИсторияДанныхАукционов.ЭлементДанных КАК ЭлементДанных,
	|	АукИсторияДанныхАукционов.ЗначениеЭлементаДанных КАК ЗначениеЭлементаДанных,
	|	АукЭлементыДанныхАукционов.ТехническоеНаименование КАК ТехническоеНаименование
	|ИЗ
	|	РегистрСведений.АукИсторияДанныхАукционов КАК АукИсторияДанныхАукционов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АукЭлементыДанныхАукционов КАК АукЭлементыДанныхАукционов
	|		ПО АукИсторияДанныхАукционов.ЭлементДанных = АукЭлементыДанныхАукционов.Ссылка
	|ГДЕ
	|	АукИсторияДанныхАукционов.Аукцион = &Аукцион
	|	И АукИсторияДанныхАукционов.ВидДанных = ЗНАЧЕНИЕ(перечисление.АукВидыДанных.Ставка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период
	|ИТОГИ ПО
	|	Период,
	|	Участник,
	|	СтрокаДанных";	
	
	Запрос.УстановитьПараметр("Аукцион", пАукцион);
	
	ПосленийПакет = АукОбщийСервер.СвойстваПоследнегоПакетаЗапроса(Запрос.Текст);
	
	масСтруктураСтавки = Справочники.АукВидыАукционов.ОписаниеСтруктурыСтавкиПоВидуАукциона(пВидАукциона);
	
	тзРезультат = АукОбщийСервер.СоздатьТаблицуПоСоставуКолонок(ПосленийПакет.Колонки, "ЗначениеЭлементаДанных,ТехническоеНаименование", масСтруктураСтавки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	АукОбщийСервер.ЗаполнитьДанныеУчастниковПоРезультатуЗапроса(тзРезультат, РезультатЗапроса,
				ПосленийПакет.КонтрольныеТочкиИтогов.Количество(), "ТехническоеНаименование", "ЗначениеЭлементаДанных");
		
	Возврат тзРезультат;
		
КонецФункции

Функция ПолнаяИсторияСтавокУчастниковАукционаПоЭтапамВСтроке(пАукцион, пВидАукциона = Неопределено) Экспорт
	
	Если пВидАукциона = Неопределено Тогда	
		пВидАукциона = Справочники.АукАукционы.КлючевыеДанныеАукциона(пАукцион).ВидАукциона;	
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукИсторияСтатусовАукционов.Период КАК Период,
	|	АукИсторияСтатусовАукционов.Аукцион КАК Аукцион,
	|	АукИсторияСтатусовАукционов.Статус КАК Статус,
	|	АукИсторияСтатусовАукционов.НомерЭтапа КАК НомерЭтапа,
	|	АукИсторияСтатусовАукционов.Этап КАК Этап
	|ПОМЕСТИТЬ втИсторияСтатусов
	|ИЗ
	|	РегистрСведений.АукИсторияСтатусовАукционов КАК АукИсторияСтатусовАукционов
	|ГДЕ
	|	АукИсторияСтатусовАукционов.Аукцион = &Аукцион
	|	И АукИсторияСтатусовАукционов.Статус В (ЗНАЧЕНИЕ(Перечисление.АукСтатусыАукционов.ПодведениеПромежуточныхИтогов), ЗНАЧЕНИЕ(Перечисление.АукСтатусыАукционов.ПодведениеИтогов), ЗНАЧЕНИЕ(Перечисление.АукСтатусыАукционов.НовыйЭтап))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИсторияСтатусов.Аукцион КАК Аукцион,
	|	МАКСИМУМ(втИсторияСтатусов.Период) КАК ПериодС,
	|	ЕСТЬNULL(втИсторияСтатусов1.Период, ДАТАВРЕМЯ(3999, 12, 31)) КАК ПериодПо
	|ПОМЕСТИТЬ втНачалоОкончаниеЭтапов
	|ИЗ
	|	втИсторияСтатусов КАК втИсторияСтатусов
	|		ЛЕВОЕ СОЕДИНЕНИЕ втИсторияСтатусов КАК втИсторияСтатусов1
	|		ПО втИсторияСтатусов.Период < втИсторияСтатусов1.Период
	|			И втИсторияСтатусов.Аукцион = втИсторияСтатусов1.Аукцион
	|			И (втИсторияСтатусов1.Статус В (ЗНАЧЕНИЕ(Перечисление.АукСтатусыАукционов.ПодведениеПромежуточныхИтогов), ЗНАЧЕНИЕ(Перечисление.АукСтатусыАукционов.ПодведениеИтогов)))
	|ГДЕ
	|	втИсторияСтатусов.Статус = ЗНАЧЕНИЕ(Перечисление.АукСтатусыАукционов.НовыйЭтап)
	|
	|СГРУППИРОВАТЬ ПО
	|	втИсторияСтатусов1.Период,
	|	втИсторияСтатусов.Аукцион
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИсторияСтатусов.Этап КАК Этап,
	|	АукИсторияДанныхАукционов.Участник КАК Участник,
	|	АукИсторияДанныхАукционов.Период КАК Период,
	|	АукИсторияДанныхАукционов.СтрокаДанных КАК СтрокаДанных,
	|	АукИсторияДанныхАукционов.ЗначениеЭлементаДанных КАК ЗначениеЭлементаДанных,
	|	АукЭлементыДанныхАукционов.ТехническоеНаименование КАК ТехническоеНаименование,
	|	ВЫБОР
	|		КОГДА АукИтогиЗавершенияЭтапов.Аукцион ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЭтоЛидирующаяСтавка
	|ИЗ
	|	втНачалоОкончаниеЭтапов КАК втНачалоОкончаниеЭтапов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втИсторияСтатусов КАК втИсторияСтатусов
	|		ПО втНачалоОкончаниеЭтапов.Аукцион = втИсторияСтатусов.Аукцион
	|			И втНачалоОкончаниеЭтапов.ПериодС = втИсторияСтатусов.Период
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АукИсторияДанныхАукционов КАК АукИсторияДанныхАукционов
	|		ПО втНачалоОкончаниеЭтапов.Аукцион = АукИсторияДанныхАукционов.Аукцион
	|			И (АукИсторияДанныхАукционов.Период МЕЖДУ втНачалоОкончаниеЭтапов.ПериодС И втНачалоОкончаниеЭтапов.ПериодПо)
	|			И (АукИсторияДанныхАукционов.ВидДанных = ЗНАЧЕНИЕ(Перечисление.АукВидыДанных.Ставка))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АукЭлементыДанныхАукционов КАК АукЭлементыДанныхАукционов
	|		ПО (АукИсторияДанныхАукционов.ЭлементДанных = АукЭлементыДанныхАукционов.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АукИтогиЗавершенияЭтапов КАК АукИтогиЗавершенияЭтапов
	|		ПО (АукИсторияДанныхАукционов.Период = АукИтогиЗавершенияЭтапов.ДатаСтавки)
	|			И (АукИсторияДанныхАукционов.Аукцион = АукИтогиЗавершенияЭтапов.Аукцион)
	|			И (АукИсторияДанныхАукционов.Участник = АукИтогиЗавершенияЭтапов.Участник)
	|			И (АукИсторияДанныхАукционов.СтрокаДанных = АукИтогиЗавершенияЭтапов.СтрокаДанных)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период
	|ИТОГИ ПО
	|	Этап,
	|	Период,
	|	Участник,
	|	СтрокаДанных";	
	
	Запрос.УстановитьПараметр("Аукцион", пАукцион);
	
	ПосленийПакет = АукОбщийСервер.СвойстваПоследнегоПакетаЗапроса(Запрос.Текст);
	
	масСтруктураСтавки = Справочники.АукВидыАукционов.ОписаниеСтруктурыСтавкиПоВидуАукциона(пВидАукциона);
	
	тзРезультат = АукОбщийСервер.СоздатьТаблицуПоСоставуКолонок(ПосленийПакет.Колонки, "ЗначениеЭлементаДанных,ТехническоеНаименование", масСтруктураСтавки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	АукОбщийСервер.ЗаполнитьДанныеУчастниковПоРезультатуЗапроса(тзРезультат, РезультатЗапроса,
				ПосленийПакет.КонтрольныеТочкиИтогов.Количество(), "ТехническоеНаименование", "ЗначениеЭлементаДанных");
	
	Возврат тзРезультат;
		
КонецФункции

Функция СведенияОбАктивностиУчастниковАукциона(пАукцион) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Аук_АукционыУчастники.Участник КАК Участник
	|ПОМЕСТИТЬ втВсеУчастники
	|ИЗ
	|	Справочник.АукАукционы.Участники КАК Аук_АукционыУчастники
	|ГДЕ
	|	Аук_АукционыУчастники.Ссылка = &Аукцион
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АукИсторияДанныхАукционов.Участник КАК Участник,
	|	АукИсторияДанныхАукционов.ВидДанных КАК ВидДанных
	|ПОМЕСТИТЬ втТемп
	|ИЗ
	|	РегистрСведений.АукИсторияДанныхАукционов КАК АукИсторияДанныхАукционов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(АукИсторияДанныхАукционов.Период) КАК Период,
	|			АукИсторияДанныхАукционов.Участник КАК Участник,
	|			АукИсторияДанныхАукционов.Аукцион КАК Аукцион
	|		ИЗ
	|			втВсеУчастники КАК втВсеУчастники
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АукИсторияДанныхАукционов КАК АукИсторияДанныхАукционов
	|				ПО (АукИсторияДанныхАукционов.Участник = втВсеУчастники.Участник)
	|		ГДЕ
	|			АукИсторияДанныхАукционов.Аукцион = &Аукцион
	|			И АукИсторияДанныхАукционов.ВидДанных <> ЗНАЧЕНИЕ(Перечисление.АукВидыДанных.Сообщение)
	|		
	|		СГРУППИРОВАТЬ ПО
	|			АукИсторияДанныхАукционов.Участник,
	|			АукИсторияДанныхАукционов.Аукцион) КАК ВложенныйЗапрос
	|		ПО АукИсторияДанныхАукционов.Участник = ВложенныйЗапрос.Участник
	|			И АукИсторияДанныхАукционов.Период = ВложенныйЗапрос.Период
	|			И АукИсторияДанныхАукционов.Аукцион = ВложенныйЗапрос.Аукцион
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втВсеУчастники.Участник КАК Участник,
	|	ВЫБОР
	|		КОГДА втТемп.ВидДанных ЕСТЬ NULL
	|			ТОГДА 1
	|		ИНАЧЕ ВЫБОР
	|				КОГДА втТемп.ВидДанных = ЗНАЧЕНИЕ(Перечисление.АукВидыДанных.Ставка)
	|					ТОГДА 0
	|				ИНАЧЕ 2
	|			КОНЕЦ
	|	КОНЕЦ КАК СтатусУчастия
	|ИЗ
	|	втВсеУчастники КАК втВсеУчастники
	|		ЛЕВОЕ СОЕДИНЕНИЕ втТемп КАК втТемп
	|		ПО втВсеУчастники.Участник = втТемп.Участник
	|			И (втТемп.Участник <> ЗНАЧЕНИЕ(Перечисление.АукВидыДанных.Сообщение))";
	
	Запрос.УстановитьПараметр("Аукцион", пАукцион);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат ЭдоОбщийСервер.РезультатЗапросаВМассивСтруктур(РезультатЗапроса);
	
КонецФункции	

Функция СформироватьЗаписиДляДобавленияВИсторию_Ставка(пСткДанныеКоманды, пМасДанныеСтавки, пНомерЭтапа, пПериод = Неопределено) Экспорт
		
	ссВидДанных		= ПредопределенноеЗначение("Перечисление.АукВидыДанных.Ставка");
	ссНаправление	= ПредопределенноеЗначение("Перечисление.АукНаправленияДанных.Входящие");
	
	Если пПериод = Неопределено Тогда
		пПериод = ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_();
	КонецЕсли;
	
	масЗаписи = Новый Массив;
	Для Сч = 0 По пМасДанныеСтавки.ВГраница() Цикл	
		сооЗначенияСтавки = пМасДанныеСтавки[Сч];
		
		Для Каждого ЭлементСтавки Из сооЗначенияСтавки Цикл
			сткЗначенияСтавки = Новый Структура;
			сткЗначенияСтавки.Вставить("ЭлементДанных",				ЭлементСтавки.Ключ);
			сткЗначенияСтавки.Вставить("ЗначениеЭлементаДанных",	ЭлементСтавки.Значение);
			
			сткЗапись = ДобавлениеДанныхВИсторию_СтруктураЗаписи(пСткДанныеКоманды, сткЗначенияСтавки, пПериод, ссВидДанных, ссНаправление, пНомерЭтапа, Сч);
			
			масЗаписи.Добавить(сткЗапись);		
		КонецЦикла;
	
	КонецЦикла;
	
	Возврат масЗаписи;
	
КонецФункции

Функция СформироватьЗаписиДляДобавленияВИсторию_Отказ(пСткДанныеКоманды, пСтрСведенияОбОтказе, пНомерЭтапа, пПериод = Неопределено) Экспорт
	
	ссВидДанных		= ПредопределенноеЗначение("Перечисление.АукВидыДанных.Отказ");
	ссНаправление	= ПредопределенноеЗначение("Перечисление.АукНаправленияДанных.Входящие");
	
	Если пПериод = Неопределено Тогда
		пПериод = ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_();
	КонецЕсли;
	
	масЗаписи = Новый Массив;
	
	сткЗначенияСтавки = Новый Структура;
	сткЗначенияСтавки.Вставить("ЭлементДанных",				ПланыВидовХарактеристик.АукЭлементыДанныхАукционов.Сообщение);
	сткЗначенияСтавки.Вставить("ЗначениеЭлементаДанных",	пСтрСведенияОбОтказе);
	
	сткЗапись = ДобавлениеДанныхВИсторию_СтруктураЗаписи(пСткДанныеКоманды, сткЗначенияСтавки, пПериод, ссВидДанных, ссНаправление, пНомерЭтапа);
	
	масЗаписи.Добавить(сткЗапись);
	
	Возврат масЗаписи;
	
КонецФункции

Функция СформироватьЗаписиДляДобавленияВИсторию_Сообщение(пСткДанныеКоманды, пСтрСообщение, ссНаправление, пНомерЭтапа, пПериод = Неопределено, пСтрокаДанных = 0) Экспорт
	
	ссВидДанных		= ПредопределенноеЗначение("Перечисление.АукВидыДанных.Сообщение");
	
	Если пПериод = Неопределено Тогда
		пПериод = ОбщегоНазначенияВызовСервера.ТекущаяДатаСервер_();
	КонецЕсли;
	
	масЗаписи = Новый Массив;
	
	сткЗначенияСтавки = Новый Структура;
	сткЗначенияСтавки.Вставить("ЭлементДанных",				ПланыВидовХарактеристик.АукЭлементыДанныхАукционов.Сообщение);
	сткЗначенияСтавки.Вставить("ЗначениеЭлементаДанных",	пСтрСообщение);
	
	сткЗапись = ДобавлениеДанныхВИсторию_СтруктураЗаписи(пСткДанныеКоманды, сткЗначенияСтавки, пПериод, ссВидДанных, ссНаправление, пНомерЭтапа, пСтрокаДанных);
	
	масЗаписи.Добавить(сткЗапись);
	
	Возврат масЗаписи;
	
КонецФункции

Функция ДанныеСтавкиУчастника(пСткОтбор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АукАукционы.Ссылка КАК Ссылка,
	|	Аук_ВидыАукционовСтруктураСтавки.НомерСтроки КАК НомерСтроки,
	|	Аук_ВидыАукционовСтруктураСтавки.ЭлементСтавки КАК ЭлементСтавки
	|ПОМЕСТИТЬ втСтруктураСтавкиПоАукциону
	|ИЗ
	|	Справочник.АукАукционы КАК АукАукционы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.АукВидыАукционов.СтруктураСтавки КАК Аук_ВидыАукционовСтруктураСтавки
	|		ПО АукАукционы.ВидАукциона = Аук_ВидыАукционовСтруктураСтавки.Ссылка
	|ГДЕ
	|	АукАукционы.Ссылка = &Аукцион
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АукИсторияДанныхАукционов.СтрокаДанных КАК СтрокаДанных,
	|	АукИсторияДанныхАукционов.ЗначениеЭлементаДанных КАК ЗначениеЭлементаДанных,
	|	АукЭлементыДанныхАукционов.Представление КАК ЭлементДанныхПредставление
	|ИЗ
	|	втСтруктураСтавкиПоАукциону КАК втСтруктураСтавкиПоАукциону
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АукИсторияДанныхАукционов КАК АукИсторияДанныхАукционов
	|		ПО втСтруктураСтавкиПоАукциону.Ссылка = АукИсторияДанныхАукционов.Аукцион
	|			И втСтруктураСтавкиПоАукциону.ЭлементСтавки = АукИсторияДанныхАукционов.ЭлементДанных
	|			И (АукИсторияДанныхАукционов.Период = &Период)
	|			И (АукИсторияДанныхАукционов.Участник = &Участник)
	|			И (АукИсторияДанныхАукционов.КонтактноеЛицо = &КонтактноеЛицо)
	|			И (АукИсторияДанныхАукционов.ВидДанных = ЗНАЧЕНИЕ(Перечисление.АукВидыДанных.Ставка))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.АукЭлементыДанныхАукционов КАК АукЭлементыДанныхАукционов
	|		ПО (АукИсторияДанныхАукционов.ЭлементДанных = АукЭлементыДанныхАукционов.Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтрокаДанных,
	|	втСтруктураСтавкиПоАукциону.НомерСтроки УБЫВ
	|ИТОГИ ПО
	|	СтрокаДанных";
	
	Запрос.УстановитьПараметр("Период",			пСткОтбор.Период);
	Запрос.УстановитьПараметр("Аукцион",		пСткОтбор.Аукцион);
	Запрос.УстановитьПараметр("Участник",		пСткОтбор.Участник);
	Запрос.УстановитьПараметр("КонтактноеЛицо",	пСткОтбор.КонтактноеЛицо);
	
	ВыборкаСтрокаДанных = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	масРезультат = Новый Массив;
	Пока ВыборкаСтрокаДанных.Следующий() Цикл
		
		ВыборкаДетальная = ВыборкаСтрокаДанных.Выбрать();
		
		сооСтрокаДанных = Новый Соответствие;
		Пока ВыборкаДетальная.Следующий() Цикл
			
			сооСтрокаДанных.Вставить(ВыборкаДетальная.ЭлементДанныхПредставление, ВыборкаДетальная.ЗначениеЭлементаДанных);
			
		КонецЦикла;	
		масРезультат.Добавить(сооСтрокаДанных);
		
	КонецЦикла;
	
	Возврат масРезультат;
	
КонецФункции	

Функция ЕстьСтавкиПоАукциону(пАукцион) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	АукИсторияДанныхАукционов.Аукцион КАК Аукцион
	|ИЗ
	|	РегистрСведений.АукИсторияДанныхАукционов КАК АукИсторияДанныхАукционов
	|ГДЕ
	|	АукИсторияДанныхАукционов.Аукцион = &Аукцион
	|	И АукИсторияДанныхАукционов.ВидДанных = Значение(Перечисление.АукВидыДанных.Ставка)";
	
	Запрос.УстановитьПараметр("Аукцион", пАукцион);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДобавлениеДанныхВИсторию_СтруктураЗаписи(пСткДанныеКоманды, пСткЭлементДанных, пПериод, пСсВидДанных, ссНаправление, пНомерЭтапа, пСтрокаДанных = 0)

	сткРезультат = Новый Структура;
	
	сткРезультат.Вставить("Период",					пПериод);
	сткРезультат.Вставить("Аукцион",				пСткДанныеКоманды.Аукцион);
	сткРезультат.Вставить("Участник",				пСткДанныеКоманды.Участник);
	сткРезультат.Вставить("СтрокаДанных",			пСтрокаДанных); // Число
	сткРезультат.Вставить("ЭлементДанных",			пСткЭлементДанных.ЭлементДанных);
	сткРезультат.Вставить("ЗначениеЭлементаДанных",	пСткЭлементДанных.ЗначениеЭлементаДанных);
	сткРезультат.Вставить("НаправлениеДанных",		ссНаправление); 
	сткРезультат.Вставить("ВидДанных",				пСсВидДанных);
	сткРезультат.Вставить("КонтактноеЛицо",			пСткДанныеКоманды.КонтактноеЛицо);
	сткРезультат.Вставить("НомерЭтапа",				пНомерЭтапа);
	
	Возврат сткРезультат;
	
КонецФункции

#КонецОбласти
